
## Plan Result (prod)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.app_insights_instrumental_key
  * azurerm_key_vault_secret.appinsights-connection-string
  * azurerm_key_vault_secret.appinsights-instrumentation-key
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/civil-service-prod/providers/Microsoft.KeyVault/vaults/civil-prod"
      + name                    = "genapp-appinsights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-general-applications.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "production"
          + "managedBy"           = "Civil"
          + "source"              = "appinsights civil-general-applications-prod"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.app_insights_instrumental_key will be created
  + resource "azurerm_key_vault_secret" "app_insights_instrumental_key" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/civil-service-prod/providers/Microsoft.KeyVault/vaults/civil-prod"
      + name                    = "AppInsightsInstrumentationKeyGeneralApplications"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-general-applications.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "production"
          + "managedBy"           = "Civil"
          + "source"              = "app insights civil-general-applications-prod"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.appinsights-connection-string will be created
  + resource "azurerm_key_vault_secret" "appinsights-connection-string" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/civil-general-applications-prod/providers/Microsoft.KeyVault/vaults/civil-gen-apps-prod"
      + name                    = "appinsights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-general-applications.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "production"
          + "managedBy"           = "Civil"
          + "source"              = "appinsights civil-general-applications-prod"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.appinsights-instrumentation-key will be created
  + resource "azurerm_key_vault_secret" "appinsights-instrumentation-key" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/civil-general-applications-prod/providers/Microsoft.KeyVault/vaults/civil-gen-apps-prod"
      + name                    = "appinsights-instrumentation-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-general-applications.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "production"
          + "managedBy"           = "Civil"
          + "source"              = "app insights civil-general-applications-prod"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "civil-general-applications-prod"
      + resource_group_name                   = "civil-general-applications-prod"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-general-applications.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "production"
          + "managedBy"           = "Civil"
        }
      + workspace_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - civil-general-applications-prod"
      + resource_group_name = "civil-general-applications-prod"
      + scopes              = (known after apply)
      + tags                = {
          + "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-general-applications.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "production"
          + "managedBy"           = "Civil"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C020H1XLM9S"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1570,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->